ê³ ê° ë°ì´í„°ì™€ êµ¬ë§¤ ë°ì´í„°ë¥¼ í†µí•©í•˜ì—¬,ì—°ë ¹ëŒ€ë³„ í‰ê·  êµ¬ë§¤ì•¡ ë¶„ì„í•˜ê¸°
â— íŒ€ì¥ë‹˜ê»˜ì„œ ê³ ê° ì •ë³´ì™€ ìµœê·¼ êµ¬ë§¤ ë‚´ì—­ ë°ì´í„°ë¥¼ ì „ë‹¬í•´ ì£¼ì…¨ìŠµë‹ˆë‹¤.
â— í•˜ì§€ë§Œ ë°ì´í„°ê°€ ì™„ë²½í•˜ì§€ëŠ” ì•Šë„¤ìš”.
â— ì—¬ëŸ¬ë¶„ì˜ ë°ì´í„° ë¶„ì„ ìŠ¤í‚¬ì„ ë°œíœ˜í•˜ì—¬ ì•„ë˜ ìš”êµ¬ì‚¬í•­ì— ë”°ë¼ ë°ì´í„°ë¥¼ ì •ì œí•˜ê³  ë¶„ì„ ë¦¬í¬íŠ¸ë¥¼ ë§Œë“¤ì–´ì£¼
ì„¸ìš”.
â˜ ì£¼ì–´ì§€ëŠ” ë°ì´í„°
â— ê³ ê° ì •ë³´ (ì§ì ‘ ìƒì„±í•´ì•¼ í•©ë‹ˆë‹¤.)
â— êµ¬ë§¤ë‚´ì—­ Ã  ğ‘œğ‘Ÿğ‘‘ğ‘’ğ‘Ÿ_â„ğ‘–ğ‘ ğ‘¡ğ‘œğ‘Ÿğ‘¦ ë°ì´í„°ì…‹ìœ¼ë¡œ ê°€ì ¸ì˜¬ ìˆ˜ ìˆìŠµë‹ˆë‹¤.
21
ì‹ ì… ë°ì´í„° ë¶„ì„ê°€ë¥¼ ìœ„í•œ ì‹¤ì „ ë¯¸ì…˜!(1/2)
ë³€ìˆ˜ëª… ë°ì´í„°
customer_id 101,102,103,104,105,106
name 'Alice','Bob','Charlie','David','Eve','Frank'
age 25,32,45,38,29,41

In [1]:
from hossam import load_data
from pandas import DataFrame ,concat , merge
import numpy as np
from sklearn.impute import SimpleImputer
from matplotlib import pyplot as plt

In [2]:
df_left = DataFrame(
    {'customer_id':[101,102,103,104,105,106],
    'name':['Alice','Bob','Charlie','David','Eve','Frank'],
    'age':[25,32,45,38,29,41]}
    )
df_left

   customer_id     name  age
0          101    Alice   25
1          102      Bob   32
2          103  Charlie   45
3          104    David   38
4          105      Eve   29
5          106    Frank   41

In [3]:
df_right = load_data('order_history')
df_right

[data] https://data.hossam.kr/data/lab04/order_history.xlsx
[desc] ì‹ ì… ë°ì´í„° ë¶„ì„ê°€ë¥¼ ìœ„í•œ ì‹¤ì „ ë¯¸ì…˜!

field        description
-----------  -------------
purchase_id  ì¼ë ¨ë²ˆí˜¸
customer_id  ê³ ê°ë²ˆí˜¸
item         ìƒí’ˆëª…
price        ê¸ˆì•¡

             customer_id             item   price
purchase_id
1                    101           Laptop  1200.0
2                    102            Mouse    25.0
3                    103         Keyboard     NaN
4                    101          Monitor   300.0
5                    104           Webcam  5000.0
6                    102          USB Hub    30.0
7                    105           Laptop  1100.0
8                    103            Mouse     NaN
9                    101     External HDD    80.0
10                   106  Docking Station   150.0

In [4]:
imr = SimpleImputer(missing_values=np.nan,strategy='mean')
df_imr = imr.fit_transform(df_right[['price']])
df_right['price'] = df_imr

df_right

             customer_id             item     price
purchase_id
1                    101           Laptop  1200.000
2                    102            Mouse    25.000
3                    103         Keyboard   985.625
4                    101          Monitor   300.000
5                    104           Webcam  5000.000
6                    102          USB Hub    30.000
7                    105           Laptop  1100.000
8                    103            Mouse   985.625
9                    101     External HDD    80.000
10                   106  Docking Station   150.000

In [5]:
df = df_right.copy()

df.loc[df['price'] > 1000, 'price'] = np.nan

imr = SimpleImputer(strategy='median')
df['price'] = imr.fit_transform(df[['price']])

df

             customer_id             item    price
purchase_id
1                    101           Laptop  150.000
2                    102            Mouse   25.000
3                    103         Keyboard  985.625
4                    101          Monitor  300.000
5                    104           Webcam  150.000
6                    102          USB Hub   30.000
7                    105           Laptop  150.000
8                    103            Mouse  985.625
9                    101     External HDD   80.000
10                   106  Docking Station  150.000

In [6]:
ë³‘í•© = merge(df,df_left,on='customer_id')
ë³‘í•©

   customer_id             item    price     name  age
0          101           Laptop  150.000    Alice   25
1          102            Mouse   25.000      Bob   32
2          103         Keyboard  985.625  Charlie   45
3          101          Monitor  300.000    Alice   25
4          104           Webcam  150.000    David   38
5          102          USB Hub   30.000      Bob   32
6          105           Laptop  150.000      Eve   29
7          103            Mouse  985.625  Charlie   45
8          101     External HDD   80.000    Alice   25
9          106  Docking Station  150.000    Frank   41

In [7]:
ìµœì¢… = ë³‘í•©.astype({'customer_id':'str'})
ìµœì¢….describe()

            price       age
count   10.000000  10.00000
mean   300.625000  33.70000
std    369.246135   8.04225
min     25.000000  25.00000
25%     97.500000  26.00000
50%    150.000000  32.00000
75%    262.500000  40.25000
max    985.625000  45.00000

In [8]:
ê°•ë‚¨ = load_data("shop_ê°•ë‚¨")
ê°•ë‚¨

[data] https://data.hossam.kr/data/lab04/shop_ê°•ë‚¨.xlsx
[desc] í©ì–´ì§„ íŒë§¤ ë°ì´í„° í†µí•©í•˜ê¸°(ì¸ë±ìŠ¤/ë©”íƒ€ë°ì´í„° ì—†ìŒ)
[!] Cannot read metadata

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [9]:
ì¢…ë¡œ = load_data("shop_ì¢…ë¡œ")
ì¢…ë¡œ

[data] https://data.hossam.kr/data/lab04/shop_ì¢…ë¡œ.xlsx
[desc] í©ì–´ì§„ íŒë§¤ ë°ì´í„° í†µí•©í•˜ê¸°(ì¸ë±ìŠ¤/ë©”íƒ€ë°ì´í„° ì—†ìŒ)
[!] Cannot read metadata

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard       999  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [13]:
ê°•ë‚¨ìˆ˜ì • = ê°•ë‚¨.copy()
ê°•ë‚¨ìˆ˜ì •.loc[(ê°•ë‚¨ìˆ˜ì •["Product"] == "Mouse") & (ê°•ë‚¨ìˆ˜ì •["Price"].isna()), "Price"] = 8000
ê°•ë‚¨ìˆ˜ì •

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [16]:
ì¢…ë¡œìˆ˜ì • = ì¢…ë¡œ.copy()
ì¢…ë¡œìˆ˜ì •.loc[(ì¢…ë¡œìˆ˜ì •["Product"] == "Keyboard") & (ì¢…ë¡œìˆ˜ì •["Quantity"] == 999), "Quantity"] = 9
ì¢…ë¡œìˆ˜ì •

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [19]:
concat([ê°•ë‚¨ìˆ˜ì •, ì¢…ë¡œìˆ˜ì •], ignore_index=True)

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0
4    B001     Mouse        15   8000.0
5    B002  Keyboard         9  14500.0
6    B003    Webcam        10  30000.0
7    B004     Mouse        18   8000.0

In [20]:
#### ë§ˆì¼€íŒ…íŒ€ ì‹ ì…ì‚¬ì›ì˜ ì²« ë²ˆì§¸ ë¯¸ì…˜

ë‹¹ì‹ ì€ ë°©ê¸ˆ ìš°ë¦¬ íšŒì‚¬ ë§ˆì¼€íŒ…íŒ€ì— ì…ì‚¬í•œ ì‹ ì…ì‚¬ì›ì…ë‹ˆë‹¤.
â— íŒ€ì¥ë‹˜ê»˜ì„œ ë‹¹ì‹ ì—ê²Œ ì²« ë²ˆì§¸ ë¯¸ì…˜ì„ ì£¼ì…¨ìŠµë‹ˆë‹¤.
ì—°ë§ì„ ë§ì´í•˜ì—¬ VIPê³ ê°ë“¤ì—ê²Œ ê°ì‚¬ì˜ ë§ˆìŒì„ ë‹´ì€
íŠ¹ë³„ ì„ ë¬¼ì„ ë³´ë‚´ë ¤ê³  í•©ë‹ˆë‹¤.
â— ë‹¹ì‹ ì˜ ì„ë¬´ëŠ” ì œê³µëœ ê³ ê° ë°ì´í„° ğ‘£ğ‘–ğ‘_ğ‘ğ‘¢ğ‘ ğ‘¡ğ‘œğ‘šğ‘’ğ‘Ÿë¥¼
ë¶„ì„í•˜ì—¬ VIPê³ ê° í›„ë³´ ëª…ë‹¨ì„ ë§Œë“œëŠ” ê²ƒì…ë‹ˆë‹¤.
â˜ ì•„ë˜ì˜ ì¡°ê±´ë“¤ì„ ëª¨ë‘ ë§Œì¡±í•˜ëŠ” ì§„ì •í•œ VIPê³ ê°ì„ ì°¾ì•„ë‚´ì–´,ê·¸ë“¤ì˜ ëª…ë‹¨ì„ íŒ€ì¥ë‹˜ê»˜ ë³´ê³ í•´ì•¼ í•©
ë‹ˆë‹¤.
â˜ ë³´ê³ í•  ë‚´ìš©
â— ìœ„ ì„¸ ê°€ì§€ ì¡°ê±´ì„ ëª¨ë‘ ë§Œì¡±í•˜ëŠ” ê³ ê°ë“¤ì„ ì´ êµ¬ë§¤ì•¡(TotalSpending)ì´ ë†’ì€ ìˆœì„œëŒ€ë¡œ ì •ë ¬í•˜ì—¬
ìƒìœ„ 5ëª…ì˜ ê³ ê° ì •ë³´ë¥¼ ì¶”ì¶œí•˜ì„¸ìš”.
â— ì¶”ì¶œëœ 5ëª…ì˜ ê³ ê° ë°ì´í„°ì—ì„œ ğ‘ğ‘ğ‘šğ‘’, ğ¶ğ‘–ğ‘¡ğ‘¦, ğ‘‡ğ‘œğ‘¡ğ‘ğ‘™ğ‘†ğ‘ğ‘’ğ‘›ğ‘‘ğ‘–ğ‘›ğ‘” ì„¸ ê°œì˜ ì—´ë§Œ ì„ íƒí•˜ì—¬ ìµœì¢… ëª…ë‹¨ì„ ë§Œë“œì„¸ìš”.

In [22]:
vip = load_data('vip_customer')
vip

[data] https://data.hossam.kr/data/lab04/vip_customer.xlsx
[desc] VIP ê³ ê° ëª©ë¡ ë°ì´í„°

field             description
----------------  ----------------
CustomerID        ê³ ê°ë²ˆí˜¸
Name              ê³ ê°ëª…
Age               ë‚˜ì´
City              ê±°ì£¼ì§€ì—­
JoinDate          ê°€ì…ì¼
TotalSpending     ì´ ì§€ì¶œì•¡
LastPurchaseDate  ë§ˆì§€ë§‰ êµ¬ë§¤ ë‚ ì§œ

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        ê¹€ì² ìˆ˜   35   ì„œìš¸ 2022-01-15         150000       2023-11-01
1002        ì´ì˜í¬   28   ë¶€ì‚° 2021-03-22          80000       2023-10-15
1003        ë°•ë¯¼ì¤€   42   ì„œìš¸ 2022-07-10         250000       2023-11-10
1004        ìµœì§€ìš°   25   ì¸ì²œ 2023-02-20          50000       2023-09-25
1005        ì •ë‹¤ì†œ   31   ì„œìš¸ 2021-11-05         320000       2023-11-12
1006        ìœ¤í˜„ìš°   38   ë¶€ì‚° 2022-05-30         120000       2023-11-05
1007        ê°•ì˜ˆì§„   29   ì„œìš¸ 2023-01-15          85000       2023-10-22
1008        ì˜¤ìŠ¹ë¯¼   45   ê´‘ì£¼ 2021-08-12         180000       2023-11-08
1009        í•œì§€ë¯¼   27   ì„œìš¸ 2022-10-01         450000       2023-11-15
1010        ì†¡ì„œì—°   33   ëŒ€ì „ 2023-04-01          65000       2023-09-30
1011        ì„ë„ìœ¤   39   ì„œìš¸ 2021-06-18         210000       2023-11-02
1012        ì¥ìœ ë‚˜   26   ë¶€ì‚° 2023-03-10          40000       2023-08-15
1013        í™©ì¬ë¯¼   41   ì„œìš¸ 2022-09-05         190000       2023-11-07
1014        ì‹ ì€ê²½   30   ëŒ€êµ¬ 2021-12-20          95000       2023-10-18
1015        ê³ ì€ë³„   36   ì„œìš¸ 2023-05-25         130000       2023-11-11

In [23]:
ìš°ìˆ˜ê³ ê° = vip.copy()
ìš°ìˆ˜ê³ ê°.query('TotalSpending >= 100000')

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        ê¹€ì² ìˆ˜   35   ì„œìš¸ 2022-01-15         150000       2023-11-01
1003        ë°•ë¯¼ì¤€   42   ì„œìš¸ 2022-07-10         250000       2023-11-10
1005        ì •ë‹¤ì†œ   31   ì„œìš¸ 2021-11-05         320000       2023-11-12
1006        ìœ¤í˜„ìš°   38   ë¶€ì‚° 2022-05-30         120000       2023-11-05
1008        ì˜¤ìŠ¹ë¯¼   45   ê´‘ì£¼ 2021-08-12         180000       2023-11-08
1009        í•œì§€ë¯¼   27   ì„œìš¸ 2022-10-01         450000       2023-11-15
1011        ì„ë„ìœ¤   39   ì„œìš¸ 2021-06-18         210000       2023-11-02
1013        í™©ì¬ë¯¼   41   ì„œìš¸ 2022-09-05         190000       2023-11-07
1015        ê³ ì€ë³„   36   ì„œìš¸ 2023-05-25         130000       2023-11-11

In [24]:
í™œë™ = vip.copy()
í™œë™.query("City == 'ì„œìš¸'")

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        ê¹€ì² ìˆ˜   35   ì„œìš¸ 2022-01-15         150000       2023-11-01
1003        ë°•ë¯¼ì¤€   42   ì„œìš¸ 2022-07-10         250000       2023-11-10
1005        ì •ë‹¤ì†œ   31   ì„œìš¸ 2021-11-05         320000       2023-11-12
1007        ê°•ì˜ˆì§„   29   ì„œìš¸ 2023-01-15          85000       2023-10-22
1009        í•œì§€ë¯¼   27   ì„œìš¸ 2022-10-01         450000       2023-11-15
1011        ì„ë„ìœ¤   39   ì„œìš¸ 2021-06-18         210000       2023-11-02
1013        í™©ì¬ë¯¼   41   ì„œìš¸ 2022-09-05         190000       2023-11-07
1015        ê³ ì€ë³„   36   ì„œìš¸ 2023-05-25         130000       2023-11-11

In [32]:
ì„ ë¬¼ = vip.copy()
ìµœì¢… = ì„ ë¬¼.query("City == 'ì„œìš¸' and TotalSpending >= 100000")
ìµœì¢…ìµœì¢… = ìµœì¢….sort_values(['TotalSpending'],ascending=False).head(5)
ìµœì¢…ìµœì¢….filter(['Name','City','TotalSpending'])

           Name City  TotalSpending
CustomerID
1009        í•œì§€ë¯¼   ì„œìš¸         450000
1005        ì •ë‹¤ì†œ   ì„œìš¸         320000
1003        ë°•ë¯¼ì¤€   ì„œìš¸         250000
1011        ì„ë„ìœ¤   ì„œìš¸         210000
1013        í™©ì¬ë¯¼   ì„œìš¸         190000

ìš°ë¦¬ëŠ” ê³ ê°ë“¤ì˜ ìµœê·¼ ì£¼ë¬¸ ë°ì´í„° ğ‘ â„ğ‘œğ‘_ğ‘œğ‘Ÿğ‘‘ğ‘’ğ‘Ÿ_ğ‘™ğ‘–ğ‘ ğ‘¡ë¥¼ í™•ë³´í–ˆìŠµë‹ˆë‹¤.
â— ì´ ë°ì´í„°ë¥¼ ë¶„ì„í•˜ì—¬ ìš°ë¦¬ì˜ ë¹„ì¦ˆë‹ˆìŠ¤ì— ë„ì›€ì´ ë  í•µì‹¬ ì¸ì‚¬ì´íŠ¸ë¥¼ ë°œê²¬í•˜ëŠ” ê²ƒì´ ë‹¹ì‹ ì˜ ì—…ë¬´ ì…ë‹ˆë‹¤.
â˜ ìš”êµ¬ì‚¬í•­
62
ì˜¨ë¼ì¸ ì‡¼í•‘ëª°ì˜ ë‹¤ìŒ ë¶„ê¸° í”„ë¡œëª¨ì…˜ ì „ëµì„ ìˆ˜ë¦½
1. ë°ì´í„° ì •ì œ:ë°ì´í„°ì— ê²°ì¸¡ì¹˜ê°€ ìˆëŠ”ì§€ í™•ì¸í•˜ê³ ,
'ğ‘ƒğ‘Ÿğ‘–ğ‘ğ‘’'ì»¬ëŸ¼ì— ìˆëŠ” ê²°ì¸¡ì¹˜ëŠ” ì „ì²´ ìƒí’ˆì˜ í‰ê· 
'ğ‘ƒğ‘Ÿğ‘–ğ‘ğ‘’'ë¡œ ëŒ€ì²´í•´ì£¼ì„¸ìš”.
2. ë² ìŠ¤íŠ¸ì…€ëŸ¬ ì¹´í…Œê³ ë¦¬ ë¶„ì„:'ğ¶ğ‘ğ‘¡ğ‘’ğ‘”ğ‘œğ‘Ÿğ‘¦'ë³„ë¡œ ì£¼ë¬¸
ê±´ìˆ˜ë¥¼ ê³„ì‚°í•˜ì—¬ ê°€ì¥ ë§ì€ ì£¼ë¬¸ì´ ë°œìƒí•œ ì¹´í…Œê³ 
ë¦¬ ìƒìœ„ 3ê°œë¥¼ ì°¾ì•„ì£¼ì„¸ìš”.
3. ì§€ì—­ë³„ êµ¬ë§¤ë ¥ ë¶„ì„:'ğ‘…ğ‘’ğ‘”ğ‘–ğ‘œğ‘›'ë³„ í‰ê·  'ğ‘ƒğ‘Ÿğ‘–ğ‘ğ‘’'ë¥¼ ê³„
ì‚°í•˜ì—¬ ì–´ëŠ ì§€ì—­ì˜ ê³ ê°ë“¤ì´ í‰ê· ì ìœ¼ë¡œ ê°€ì¥ ë¹„
ì‹¼ ìƒí’ˆì„ êµ¬ë§¤í•˜ëŠ”ì§€ í™•ì¸í•´ì£¼ì„¸ìš”.ê²°ê³¼ëŠ” í‰ê· 
êµ¬ë§¤ì•¡ì´ ë†’ì€ ìˆœì„œëŒ€ë¡œ ì •ë ¬í•˜ì—¬ ë³´ì—¬ì£¼ì„¸ìš”.

In [34]:
origin = load_data('shop_order_list')
origin

[data] https://data.hossam.kr/data/lab04/shop_order_list.xlsx
[desc] ì˜¨ë¼ì¸ ì‡¼í•‘ëª°ì˜ ìµœê·¼ ê³ ê° ì£¼ë¬¸ ë°ì´í„°
[!] Cannot read metadata

          UserID   Product   Price     Category   Region  OrderDate
OrderID
1001     user001    Laptop  1200.0  Electronics    Seoul 2023-01-15
1002     user002     Mouse    25.0  Electronics    Busan 2023-01-16
1003     user003  Keyboard    70.0  Electronics    Seoul 2023-01-17
1004     user001      Book    15.0        Books  Incheon 2023-01-18
1005     user004   T-shirt    30.0      Apparel  Gwangju 2023-01-19
1006     user002      Book    20.0        Books    Seoul 2023-01-20
1007     user005     Jeans    80.0      Apparel    Busan 2023-02-21
1008     user001   Monitor   300.0  Electronics    Seoul 2023-02-22
1009     user006      Book    18.0        Books    Daegu 2023-02-23
1010     user007    Jacket   150.0      Apparel    Seoul 2023-02-24
1011     user003    Webcam     NaN  Electronics  Incheon 2023-03-25
1012     user008    Coffee     5.0         Food    Busan 2023-03-26
1013     user009     Snack     3.0         Food  Gwangju 2023-03-27
1014     user002    Laptop  1300.0  Electronics    Seoul 2023-03-28
1015     user010     Shoes   120.0      Apparel    Daegu 2023-03-29
1016     user005      Book    22.0        Books    Seoul 2023-04-10
1017     user001      Desk   250.0    Furniture    Busan 2023-04-11
1018     user004     Chair     NaN    Furniture    Seoul 2023-04-12
1019     user007      Book    12.0        Books  Incheon 2023-04-13
1020     user003       Hat    40.0      Apparel    Seoul 2023-04-14